test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    patch0_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          9;
        startFace       12;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  patch0_half1;
    }
    patch0_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          9;
        startFace       21;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  patch0_half0;
    }
    patch1_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          3;
        startFace       30;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  patch1_half1;
    }
    patch1_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          3;
        startFace       33;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  patch1_half0;
    }
    patch2_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          3;
        startFace       36;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  patch2_half1;
    }
    patch2_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          3;
        startFace       39;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  patch2_half0;
    }
)

// ************************************************************************* //
